#### Terraform Plan for live environment 📖 `success`

<details><summary>Show Plan</summary>

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mersthamcc/accounts-live/runs/run-kKmzomEqcEoxZqUm

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_password.end_of_day_password: Refreshing state... [id=none]
random_password.end_of_day_username: Refreshing state... [id=none]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:947309733994:certificate/474dc888-5cfa-4ab9-a50d-781a930a44a6]
aws_api_gateway_rest_api.api: Refreshing state... [id=dvzs0cr2fi]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=live-queue-processor-lambda-role]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=live-end-of-day-lambda-role]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=live-match-fee-lambda-role]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-logging]
aws_iam_role.lambda_iam_role: Refreshing state... [id=live-standard-lambda-role]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=live-match-fee-lambda-role-20210725155508033900000002]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=live-end-of-day-lambda-role-20210721203943143500000003]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=live-queue-processor-lambda-role-20210721203943309800000007]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=live-standard-lambda-role-20210721203943141000000002]
module.match_fee_transfer_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-match-fee-transfer-lambda]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
time_sleep.wait_60_seconds: Refreshing state... [id=2021-07-20T23:15:10Z]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=6w8bcx]
module.match_fee_transfer_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=g1ken0]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=5jwz1s]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=8zfi9v]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z0577271GSI0V6WKPVVN__fcfa245a7bc80ef625194fe777667542.api.accounting.mersthamcc.co.uk._CNAME]
module.match_fee_transfer_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-g1ken0-POST]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-6w8bcx-GET]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-5jwz1s-POST]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-8zfi9v-GET]
aws_dynamodb_table_item.test-config: Refreshing state... [id=config|id||live|]
aws_acm_certificate_validation.api: Refreshing state... [id=2021-07-21 20:40:00 +0000 UTC]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-audit-lambda-dynamo-policy]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-dynamo-policy]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-20210721203953435000000008]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=live-end-of-day-lambda-role-20210721203943151000000004]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=live-standard-lambda-role-20210721203943153800000005]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-20210721203943304100000006]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=live-match-fee-lambda-role-20210725155508003400000001]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=10a308bc-b828-45c6-9de2-1d3e6d4152be]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
module.match_fee_transfer_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.match_fee_transfer_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-g1ken0-POST]
module.match_fee_transfer_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-lambda]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-5jwz1s-POST]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
aws_route53_record.api: Refreshing state... [id=Z0577271GSI0V6WKPVVN_api.accounting.mersthamcc.co.uk_A]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
aws_cloudwatch_log_metric_filter.transaction_processing_missing_tender_metric: Refreshing state... [id=live-transaction-processing-missing-tender-warning]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-6w8bcx-GET]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-8zfi9v-GET]
aws_api_gateway_deployment.deployment: Refreshing state... [id=2efw4t]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-dvzs0cr2fi-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue.transactions has been changed
  ~ resource "aws_sqs_queue" "transactions" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions"
        name                              = "live-transactions"
      ~ policy                            = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                                "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                              + "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                    {
                        Action    = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                        Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions"
                        Sid       = "ReceiveSQS"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags                              = {}
        # (11 unchanged attributes hidden)
    }
  # aws_sqs_queue_policy.process_transactions_queue_policy has been changed
  ~ resource "aws_sqs_queue_policy" "process_transactions_queue_policy" {
        id        = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                                "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                              + "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                    {
                        Action    = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                        Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions"
                        Sid       = "ReceiveSQS"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2021-07-25T16:09:04Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:947309733994:dvzs0cr2fi/" -> (known after apply)
      ~ id            = "2efw4t" -> (known after apply)
      ~ invoke_url    = "https://dvzs0cr2fi.execute-api.eu-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "6c9eb5b4abb5a406981c7210109cc78d5b5f7843" -> "7bd6d3165396525a9e6b3cebc1fedd778cd5e8d1"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "2efw4t" -> (known after apply)
        id                    = "ags-dvzs0cr2fi-live"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.match_fee_schedule will be created
  + resource "aws_cloudwatch_event_rule" "match_fee_schedule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "live-match-fee-transfer-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 6 ? * FRI *)"
      + tags_all            = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
    }

  # aws_cloudwatch_event_target.match_fee_schedule_target will be created
  + resource "aws_cloudwatch_event_target" "match_fee_schedule_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "live-match-fee-transfer-schedule"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/live-match-fee-transfer-schedule"
      + retention_in_days = 90
      + tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
    }

  # aws_lambda_function.match_fee_lambda will be created
  + resource "aws_lambda_function" "match_fee_lambda" {
      + arn                            = (known after apply)
      + function_name                  = "live-match-fee-transfer-schedule"
      + handler                        = "cricket.merstham.website.accounts.lambda.MatchFeeTransferScheduled::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::947309733994:role/live-match-fee-lambda-role"
      + runtime                        = "java11"
      + s3_bucket                      = "mcc-accounts-deployment"
      + s3_key                         = "live-accounts.zip"
      + s3_object_version              = "6eahKeqwZH0VNYOo9J7Wx1oetEb3thDh"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONFIG_NAME" = "live"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_match_fee_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_match_fee_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "live-match-fee-transfer-schedule"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 6 to add, 1 to change, 1 to destroy.


```

</details>